Repository: synspawacza/automata_pl
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: pl

source: It was a common human idiom. Meaning unclear.
pl: To był znany ludzki idiom. Jego znaczenie pozostaje niejasne.

source: It was a lesson we learned from mankind's past history. Most fascinating, don't you think?
pl: To lekcja, którą wyciągnęliśmy z historii ludzkiości. Nie sądzisz, że to fascynujące?

source: It was a practical design decision to allow combat units to also collect intelligence.
pl: To była praktyczna decyzja projektowa, pozwolić jednostkom bojowym zbierać też wywiad.

source: It was commonly referred to as a "roller coaster."
pl: Potocznie było nazywane „roller coasterem”.

source: It was designed to help annihilate the androids, but it wound up going out of control.
pl: Została zaprojektowana w taki sposób, aby pomóc w unicestwianiu androidów, ale ostatecznie wymknęła się spod kontroli.

source: It was fun talking with you. Come back anytime!
pl: Miło się z tobą gawędziło. Zapraszam ponownie!

source: It was hard for me as well.
pl: Dla mnie to też było trudne.

source: It was hard. So hard. And after a while, I couldn't live with what I had done.
pl: To było trudne. Bardzo trudne. A po pewnym czasie nie byłam w stanie dalej żyć z tym, co zrobiłam.

source: It was like I had a family. </page> <page> My damage worsens.<bt_wait> I start to lose my memories.<bt_wait><BGM_BGM_M3060_S0910_N_0020> The space fills up with pure white light. It's like being buried in snow.<color_505050><bt_wait>
pl: Tak jak bym miał rodzinę. </page> <page> Moje obrażenia się pogarszają.<bt_wait> Zaczynam tracić wspomnienia.<bt_wait><BGM_BGM_M3060_S0910_N_0020> Przestrzeń wypełnia się czystym światłem. Jakbym był zakopany w śniegu.<color_505050><bt_wait>

source: It was like memories of pure light...
pl: Był jak wspomnienia o najczystszym świetle...

source: It was meant to be a launch tower for sending rockets to the very moon itself!
pl: To miała być wieża startowa do wysyłania rakiet na sam księżyc!

source: It was once occupied by a cadre of fellow machines that had gone berserk.
pl: Kiedyś stacjonował tu oddział maszyn, które wpadły w szał.

source: It was right outside the village!
pl: Był tuż przed wioską!

source: It was rude to even ask. Please forgive me.
pl: Przepraszam... To było niegrzeczne z mojej strony, że w ogóle zapytałem.

source: It was so hard... So painful...
pl: To takie ciężkie... Tak bolesne...

source: It was talking.
pl: To coś... mówiło.

source: It was worth deceiving the world
pl: Warto oszukać świat

source: It wasn't perfect, of course. Mistakes were made along the way. Still, we remained friends.
pl: Nie wszystko było idealne, rzecz jasna. Popełnialiśmy błędy. Mimo to, pozostaliśmy przyjaciółmi.

source: It will be a parade of love and friendship for all!
pl: Będzie to parada miłości i przyjaźni dla wszystkich!

source: It will be okay now, Brother!
pl: Wszystko będzie w porządku, bracie!

source: It will continue on for long time to come.
pl: Będziemy to kontynuować jeszcze przez długi czas.

source: It will finally be over. </page> I can't do it.<bt_wait> I can't pull the trigger.<bt_wait> My systems seem normal, yet my breathing is hurried and I'm sweating.<bt_wait> My eyes are dry. I'm getting odd value readings from my vitals.<bt_wait> I can't move my legs. It's like they're stuck in mud.<bt_wait>
pl: Wreszcie się skończy. </page> <page> Nie mogę tego zrobić.<bt_wait> Nie mogę pociągnąć za spust.<bt_wait> Moje systemy zdają się być w normie, ale pocę się, a mój oddech jest przyśpieszony.<bt_wait> Moje oczy są suche. Dostaję dziwne odczyty moich oznak życiowych.<bt_wait> Nie mogę poruszać nogami, tak jakby utknęły w błocie.<bt_wait>

source: It won't be complete until we dig into a deeper layer and—
pl: A pełne odtworzenie danych wymaga zejścia na głębszy poziom i...

source: It won't open...
pl: Nie chcą się otworzyć...

source: It would appear to be machine-related in origin. Further details unknown.
pl: Najwyraźniej jego pochodzenie jest związane z maszynami. Dalsze szczegóły nie są znane.

source: It would be more efficient to traverse the rocky area instead.
pl: Wydaje się, że bardziej efektywne byłoby podróżowanie skalistym terenem.

source: It would be nice for you to know more about us.
pl: Byłoby miło, gdybyś dowiedziała się o nas więcej.

source: It'd be a shame to let all these parts go to waste, no?
pl: Byłaby szkoda jakby te części się zmarnowały, racja?

source: It'd be amazing if you cleared this alone.
pl: Byłoby niesamowite, gdybyś przeszedł to samemu.

source: It'll be dangerous, but we're not going anywhere unless we pass through that Goliath's legs.
pl: Będzie niebezpiecznie, ale nic nie zrobimy, jeśli nie przedrzemy się przez nogi tego Goliata.

source: It'll be faster if you just take a look at this recording.
pl: Będzie szybciej, jeśli po prostu spojrzysz na nagranie.

source: It'll cost money and materials, but you'll end up with a stronger Pod.
pl: Będzie to kosztować pieniądze i materiały, ale w zamian twój Pod stanie się silniejszy.

source: It'll let you access the elevator in the shopping mall.
pl: Pozwoli wam wejść do windy, znajdującej się w centrum handlowym.

source: It'll probably be easiest to just bring you some. Try to hang on until then, all right?
pl: Chyba najłatwiej będzie, jak ci go, po prostu, trochę przyniesiemy. Spróbujcie wytrzymać do tego czasu, dobrze?

source: It's Eve. It's got to be.
pl: To Ewa. To musi być on.

source: It's MINE! Mine. I'm gonna...drink it all up! Mee-YOW!
pl: Jest MOJA! Moja. Zamierzam... wypić całość! Mi-AU!

source: It's Number 21. The girl I'd thought to be cool and composed beyond all measure was now pleading with me to spare Lilly's life.<bt_wait>
pl: To Numer 21. Dziewczyna, którą uważałam za spokojną i opanowaną w każdej sytuacji, teraz błaga mnie o darowanie Lilly życia.<bt_wait>

source: It's YoRHa!
pl: To YoRHa!

source: It's a Lunar Tear. I'd better tell Emil.
pl: To Księżycowa Łza. Lepiej powiem o niej Emilowi.

source: It's a bit of a hike, but should we check it out?
pl: To kawałek drogi stąd, ale może warto to sprawdzić?

source: It's a comfortable life. I have everything I need.
pl: To wygodne życie. Mam wszystko czego mi trzeba.

source: It's a fossil. One of your followers asked us to deliver it to you.
pl: To skamielina. Jedna z twoich wyznawczyń poprosiła nas, abyśmy ci ją dostarczyli.

source: It's a fuel filter that she requested.
pl: To filtr paliwa, o który prosiła.

source: It's a little bit cold.<color_606060><bt_wait> It's a little bit frightening.<color_707070><bt_wait> Will my soul...disappear? </page> <page> A dark fog clouds my vision.<bt_wait> As it ebbs and flows in its slow, dreamlike way, it gradually takes human shape.<bt_wait>
pl: Jest też troszkę zimno.<color_606060><bt_wait> Jest też troszkę strasznie.<color_707070><bt_wait> Czy moja dusza... zniknie? </page> <page> Ciemna mgła zasłania mój wzrok.<bt_wait> Kiedy opada i przepływa w swym powolnym, sennym ruchu, powoli przyjmuje ludzki kształt.<bt_wait>

source: It's a maze. A labyrinth. A massive interconnected network. I've never seen anything like it.<bt_wait>
pl: To plątanina. Labirynt. Masywna, połączona sieć. Nigdy wcześniej nie widziałem czegoś takiego.<bt_wait>

source: It's a pretty rare plant, but I'd start by searching around the old ruins in the desert.
pl: To dość rzadka roślina, ale zaczęłabym jej szukać w okolicach starych ruin na pustyni.

source: It's a secret from the others, but there are some good machines out there...
pl: Nie warto mówić tego innym, ale słyszałam, że są też maszyny, które potrafią być dobre...

source: It's a secret, but check it out if you like...
pl: To tajemnica, ale jak chcesz to możesz zobaczyć...

source: It's a shooting game. I have the feeling it's still really buggy though...
pl: To strzelanka. Ale mam przeczucie, że jest jeszcze mocno niedopracowana...

source: It's a thank-you present!
pl: To prezent dziękczynny!

source: It's a wonderful sight, seeing machine bits fly everywhere, isn't it? Makes me feel all peaceful inside.
pl: To cudowny widok, oglądanie latających na wszystkie strony kawałków maszyn, prawda? Sprawia, że czuję wewnętrzny spokój.

source: It's about the YoRHa soldiers who deserted.
pl: Chodzi o zbuntowanych żołnierzy YoRHa, którzy zdezerterowali.

source: It's actually pretty popular among Resistance combat models. Not that it has much of an effect...
pl: To danie jest bardzo popularne wśród bojowych modeli Ruchu Oporu. Nie, żeby wiele zmieniało...

source: It's all over...
pl: To już koniec...

source: It's all pretty fuzzy, but I seem to have a memory of caring for this flower a long time ago...
pl: To wspomnienie wydaje się dość niejasne... Ale wydaje mi się, że dawno temu opiekowałem się tym kwiatem...

source: It's all right now.
pl: Już dobrze.

source: It's all right. You're safe with us.
pl: Już dobrze. Tu jesteśmy bezpieczni.

source: It's all right... It's all right...
pl: Dobrze... Już dobrze...

source: It's all so damnably frustrating. I am the world's foremost genius, after all! Never before have I sipped the bitter brew of defeat!
pl: To wszystko jest cholernie frustrujące. W końcu jestem największym geniuszem na świecie! Nigdy wcześniej nie poczułem gorzkiego smaku porażki!

source: It's all so very amusing...
pl: To wszystko jest takie zabawne...

source: It's almost annoying how quickly muscleheads learn to like one another. </page>
pl: To prawie irytujące, jak mięśniaki szybko uczą cię nawzajem siebie lubić. </page>

source: It's almost as if the objective is <i>failure itself</i>.<bt_wait>
pl: Zupełnie, jakby ich celem była <i>porażka sama w sobie</i>.<bt_wait>

source: It's almost like it had actual emotion—
pl: Zupełnie jakby miała uczucia...

source: It's almost like they were trying to lay a trap.
pl: Wygląda na to, że próbowały zastawić pułapkę.

source: It's almost stupid difficult, but more daring players seem to like it.
pl: Jest aż idiotycznie trudny, ale co śmielsi gracze to lubią.

source: It's almost time to head out.
pl: Zbliża się czas, by ruszać.

source: It's always weird to see units of the same model as me getting put together.
pl: To zawsze jest dziwne widzieć, jak jednostki tego samego modelu co ja są składane.

source: It's an amazing thing to overcome different ideologies and interests and join hands in friendship.
pl: To niesamowite, przełamać różnice w ideologiach i interesach, i złączyć ręce w przyjaźni.

source: It's an electromagnetic-wave shielding device. I wear it to limit unnecessary information from the world.
pl: To urządzenie blokujące fale elektromagnetyczne. Noszę ją, by ograniczyć napływ niepotrzebnych informacji ze świata.

source: It's as dirty as it is heavy.
pl: Równie brudna co ciężka.

source: It's been a while since someone cleared the highest rank. You're gonna be a great hunter, I can tell!
pl: Dużo czasu minęło od kiedy ktokolwiek pokonał najwyższą rangę. Powiem ci, że będzie z ciebie dobry łowca.

source: It's been days now, and she's still not back. Please, you have to help me! I'll pay you whatever you want!
pl: Ale minęło już kilka dni, a ona nadal nie wróciła. Proszę, musicie mi pomóc! Zapłacę tyle, ile zarządacie!

source: It's been getting more dangerous recently. Make sure you're ready.
pl: Ostatnio jest niebezpieczniej. Upewnij się, że masz odpowiednio dobre wyposażenie.

source: It's been installed on a pair of flight units that are heading your way.
pl: I właśnie taka zmodyfikowana para zmierza w waszym kierunku.

source: It's been tough lately, but it's important to get rest. Make sure you keep your weapons in good order, too.
pl: Ostatnio było ciężko, ale ważnym jest, aby odpoczywać. Upewnij się też, że posiadana przez ciebie broń jest w dobrym stanie.

source: It's bloody disgusting, is what it is.
pl: To cholernie obrzydliwe, ot co.

source: It's currently being engaged by a swarm of machines.
pl: Aktualnie atakują go roje maszyn.

source: It's dangerous to look for reason in everything.
pl: Niebezpiecznie jest szukać sensu we wszystkim.

source: It's data from the old world, but it's...
pl: To dane ze starego świata, jednak...

source: It's difficult to forget what the machines did to us...and what we did to them.
pl: Ciężko będzie zapomnieć, co maszyny nam zrobiły... i co my zrobiliśmy im.

source: It's do or die from now on. Good luck.
pl: Od teraz zrób to, albo zgiń. Powodzenia.

source: It's enough of a pain in the rear to maintain a list of all units as it is. I wish they'd at least tell us if they were bailing.
pl: Utrzymywanie listy wszystkich jednostek to już wystarczający wrzód na tyłku. Chciałbym żeby chociaż mówili nam, jak uciekają.

source: It's fascinating, don't you think? What could possibly drive such behavior?
pl: To fascynujące, nie sądzisz? Co mogłoby powodować takie zachowanie?

source: It's fine. Does that question have anything to do with our operation?
pl: W porządku. Czy to pytanie ma cokolwiek wspólnego z naszą misją?

source: It's fine. Run the search.
pl: W porządku. Przeprowadź skanowanie.

source: It's fine... Upload 2B's data first.
pl: W porządku... Załaduj najpierw dane 2B.

source: It's freakin' HUGE...
pl: Jest przerażająco OGROMNA...

source: It's funny...
pl: Zabawne...

source: It's go time!
pl: Czas ruszać!

source: It's going to explode!
pl: Zaraz wybuchnie!

source: It's good to see you in one piece. I was worried I'd lost a valuable customer.
pl: Dobrze cię widzieć w jednym kawałku. Już się martwiłem, że stracę cennego klienta.

source: It's gotta make up for screwing up the planet like this, am I right?
pl: Musi odpokutować za doprowadzenie planety do takiego stanu, prawda?

source: It's grand, don't you think? Almost...spiritual. And yet it's currently nothing more than an android graveyard!
pl: Jest wspaniałe, nie sądzisz? Niemal... duchowe. I jednocześnie nie jest niczym więcej, jak tylko cmentarzem androidów!

source: It's great having another Scanner helping me out. Thanks to you, I've gathered the data 60 percent faster than I'd planned.
pl: To wspaniale mieć innego Skanera do pomocy. Dzięki tobie, udało mi się zebrać dane 60 procent szybciej, niż planowałem.

source: It's great you came all this way just to see me, but I'm swamped! Maybe let's hook up later.
pl: Cieszę się, że wracasz tą całą drogę tylko, by się ze mną zobaczyć, ale jestem zawalona! Może uda się spotkać później.

source: It's hard to get an accurate picture from this—our satellite resolution isn't so hot.
pl: Ciężko jest uzyskać z tego dobry obraz — rozdzielczość naszych satelitów pozostawia wiele do życzenia.

source: It's hard to see the 3D map...
pl: Ciężko jest oglądać mapę 3D...

source: It's heading for that rocky area!
pl: Kieruje się na te kamieniste tereny!

source: It's how we were made.
pl: W taki sposób zostaliśmy zaprojektowani.

source: It's important for people to have time to themselves, don't you think?
pl: To ważne, aby ludzie mieli czas dla siebie, nie sądzisz?

source: It's in pain because it can't find value in its own existence?
pl: Cierpi, bo nie jest w stanie odnaleźć wartości własnej egzystencji?

source: It's just a game in the end, right?
pl: Koniec końców to tylko gra, racja?

source: It's just a statue.
pl: To tylko pomnik.

source: It's just accessing random nonsensical data from the old world.
pl: Nic, nic... Po prostu złapałem tutaj dostęp do losowych i bezsensownych danych ze starego świata.

source: It's just bad news everywhere you look.
pl: Gdzie nie spojrzeć, same złe wieści.

source: It's just so beautiful! I've never heard anything like it!
pl: Jest taka piękna! Nigdy wcześniej czegoś takiego nie słyszałam!

source: It's just that...I, I cannot let you through!
pl: Po prostu... Nie mogę was przepuścić.

source: It's just that...she was always such a hard ass, you know? To think she wanted to run away just... Ha ha!
pl: No bo... Ona zawsze zgrywała taką twardą sztukę, wiesz? A okazało się, że chciała uciec. Tak po prostu... Ha ha!

source: It's kind of fun!
pl: A tak jest fajnie!

source: It's like I'm in a dream.
pl: Czuję się zupełnie tak, jakbym śnił.

source: It's like she was built to be as efficient and hard-assed as possible.
pl: Jakby została zaprojektowana tak, żeby być maksymalnie efektywna i bezwzględnie surowa.

source: It's like something's pushing down on my chest really hard...
pl: Zupełnie, jakby coś bardzo mocno naciskało na moją klatkę piersiową...

source: It's like they see us as a couple of gofers or something.
pl: Zupełnie, jakby traktowali nas jak zwykłych posłańców.

source: It's like they were gathered here.
pl: Zupełnie jakby ktoś je tu celowo zgromadził.

source: It's made from cores from the machines?
pl: Została wykonana z rdzeni maszyn?

source: It's me! 9S!
pl: To ja! 9S!

source: It's much easier than digging up the iron ourselves.
pl: To łatwiejsze niż wykopywanie żelaza samemu.

source: It's my duty to see this through to the end.
pl: Moim obowiązkiem jest doprowadzić to do końca.

source: It's nice having a home to go back to, don't you think?
pl: Fajnie jest mieć dom, do którego można wrócić, nie sądzisz?

source: It's nice to change your hair color every once in a while, you know?
pl: Dobrze jest raz na jakiś czas przefarbować włosy, co nie?

source: It's no fun playing on your own.
pl: Zabawa samemu nie jest taka fajna.

source: It's no use... There's too much static, and I can't hear a single thing.
pl: To na nic... Za dużo szumu i nie jestem w stanie nic usłyszeć.

source: It's not a priority or anything. Just if you have the time.
pl: Nie jest to pilne. Być może uda ci się znaleźć chwilę, aby się temu przyjrzeć...

source: It's not a waste.
pl: To nie jest żadna strata.

source: It's not easy being a defective model, you know?
pl: Nie jest łatwo być wadliwym modelem, wiesz?

source: It's not enough! I want more!
pl: To nie wystarczy! Chcę więcej!

source: It's not fair!
pl: To nie w porządku!

source: It's not fair! My only brother...
pl: To nie fair! Mój jedyny brat...

source: It's not for us to judge their value.
pl: Nie do nas należy ocenianie ich wartości.

source: It's not going to be easy, so we've got to be prepared.
pl: To nie będzie łatwe, więc dobrze się przygotuj.

source: It's not like Command to get a location wrong.
pl: To nie tak że dowództwo pomyliło miejsca.

source: It's not like Command to get a location wrong. I guess even they get bad intel from time to time, huh?
pl: To raczej nie w stylu Dowództwa, żeby podali złą lokalizację. Jednak, ich wywiad też może, od czasu do czasu, się pomylić, co nie?

source: It's not like we YoRHa androids have a home to return to.
pl: Nie jest tak, że my, androidy YoRHa, mamy do czego wracać...

source: It's not moving. Maybe just a statue?
pl: Nie rusza się. Może to tylko pomnik?

source: It's not much, but I have a reward for you. Oh, but don't tell the Commander—it's probably against regulations.
pl: To niezbyt wiele, ale mam dla ciebie nagrodę. Tylko nie mów o tym Pani Komandor. To, zapewne, wbrew zasadom.

source: It's not my business.
pl: To nie mój interes.

source: It's not my fault, okay!?
pl: To nie moja wina, okej?!

source: It's not recommended to interface with machines without consulting Command.
pl: Nie jest zalecane nawiązywanie interakcji z maszynami bez konsultacji z Dowództwem.

source: It's not that easy, you dumbass!
pl: To nie takie proste, głąbie!

source: It's okay. I can always reload my backup data from the Bunker.
pl: W porządku. W każdej chwili mogę załadować swoje zapasowe dane z Bunkra.

source: It's open.
pl: Otwarte.

source: It's over... It's all over...
pl: To koniec... To koniec...

source: It's possible this is based on an identical pleasure center in the human brain. Man, those fleshbags really were something!
pl: Możliwe, że bazuje to na takim samym ośrodku przyjemności jak u ludzi. Człowieku, te worki mięsa naprawdę były niesamowite!

source: It's possible to access the Bunker through a backdoor in the system.
pl: Istnieje możliwość uzyskania dostępu do Bunkra poprzez tylne wejście w systemie.

source: It's probably because I deferred our data sync.
pl: To pewnie dlatego, że wstrzymałem się z synchronizacją danych.

source: It's quite...fascinating.
pl: Jest dość... fascynująca.

source: It's ready.
pl: Jest gotowa.

source: It's resonating in tandem with the area beneath the combat zone!
pl: Rezonują z terenem położonym pod polem bitwy!

source: It's rude to eavesdrop!
pl: Niegrzecznie jest podsłuchiwać!

source: It's rude to give a person something without their permission. What if they don't want it?
pl: To niegrzeczne dawać komuś coś, bez jego zgody. A co, jeśli taka osoba tego nie chce?

source: It's sad, but things don't always work out.
pl: To smutne, ale nie wszystko się udaje.

source: It's said that a Lunar Tear can make any wish come true.
pl: Krążą plotki, że Księżycowe Łzy potrafią spełnić dowolne życzenie.

source: It's simple, really: If I pretend to prefer smaller denominations of coins, the people around me are so entertained, they keep giving them to me.
pl: To naprawdę proste: jeśli udaję, że wolę mniejsze nominały, wszyscy wokół mnie są tym faktem tak rozbawieni, że mi je dają.

source: It's simple...
pl: To proste...

source: It's so dark... Mommy... I've been born! Mommy... Where are you? What...should I do? Tell me what to do, Mommy. Please... I'll try my best... Please don't leave me alone... I'm so lonely, Mommy... Mommy... Mommy... Mommy... Mommy... Mommy...
pl: Jest tak ciemno... Mamusiu... Narodziłem się! Mamusiu... Gdzie jesteś? Co... mam zrobić? Powiedz mi, co robić Mamusiu. Proszę... Postaram się jak najlepiej... Proszę, nie zostawiaj mnie samego... Jestem taki samotny, Mamusiu... Mamusiu... Mamusiu... Mamusiu... Mamusiu... Mamusiu...

source: It's so easy to do from up there. From the satellite. From the moon. </page> We can't go back and we can't go forward. So instead, we split in two.<bt_wait>
pl: Tak łatwo to zrobić z góry. Z satelity. Z księżyca. </page> <page> Nie możemy wrócić i nie możemy iść naprzód. Zamiast tego, dzielimy się na dwoje.<bt_wait>

source: It's so relaxing to listen to music...don't you agree?
pl: Słuchanie muzyki jest takie relaksujące... Nie uważasz?

source: It's still something. Thank you.
pl: To zawsze coś. Dziękuję.

source: It's strange. I thought I'd be sad, but instead I feel...peace.
pl: Jakie to dziwne. Myślałem, że będę smutny, ale zamiast tego, czuję... spokój.

source: It's surprising to see them form familial units like that.
pl: To zadziwiające, że tworzą coś na kształt rodzin.

source: It's the King! Please protect us! In line with the rules, of course.
pl: To Król! Proszę, chroń nas! W zgodzie z zasadami, rzecz jasna.

source: It's the barrier...
pl: To ta bariera...

source: It's the final act of Lilly and the others in the rearguard.<bt_wait> They just overloaded their own fusion reactors. </page>
pl: To ostatnie dzieło Lilly i reszty w straży tylnej.<bt_wait> Po prostu przeciążyły własne reaktory fuzyjne. </page>

source: It's the least we can do. Feel free to use it however you like.
pl: Przynajmniej tyle mogliśmy dla was zrobić. Korzystajcie z niego, jak tylko chcecie.

source: It's the place from my memories that I worked so hard to protect.
pl: To jest miejsce z moich wspomnień, które tak bardzo starałem się ochronić.

source: It's the red girl.<bt_wait>
pl: To czerwona dziewczynka.<bt_wait>

source: It's the truth. She has to know.
pl: Taka jest prawda. Powinna ją poznać.

source: It's the voice of someone who still has hope, despite all the odds.
pl: Jest to głos osoby, która wciąż ma nadzieję, niezależnie od okoliczności.

source: It's time to battle for your future! Now...FIGHT!
pl: Czas na bitwę o waszą przyszłość! A teraz... WALKA!

source: It's time to kick off this D-rank match, folks!
pl: Czas zacząć nowe zawody rangi D, ludziska!
